tangyangguang/Esp32_Irrigation/firmware/src/irrigation/IrrigationWeb.cpp
const char* zoneResultName(ZoneWateringResult result) {
    switch (result) {
        case ZoneWateringResult::Completed: return "完成";
        case ZoneWateringResult::Stopped: return "停止";
        case ZoneWateringResult::Failed: return "失败";
        default: return "未开始";
    }
}

const char* sourceName(WateringSource source) {
    switch (source) {
        case WateringSource::ManualZones: return "手动浇水";
        case WateringSource::SingleOutput: return "单次出水";
        case WateringSource::AutomaticPlan: return "自动计划";
    }
    return "未知";
}

void sendUnsigned(uint32_t value) {
    char text[16];
    std::snprintf(text, sizeof(text), "%lu", static_cast<unsigned long>(value));
    Esp32BaseWeb::sendChunk(text);
}

void sendUnsigned64(uint64_t value) {
    char text[32];
    std::snprintf(text, sizeof(text), "%llu",
                  static_cast<unsigned long long>(value));
    Esp32BaseWeb::sendChunk(text);
}

void formatSignedHundredths(int64_t value,
                            char* output,
                            std::size_t outputSize,
                            bool alwaysShowSign = false) {
    const bool negative = value < 0;
    const uint64_t magnitude = negative
                                   ? static_cast<uint64_t>(-(value + 1)) + 1U
                                   : static_cast<uint64_t>(value);
    std::snprintf(output,
                  outputSize,
                  "%s%llu.%02llu",
                  negative ? "-" : (alwaysShowSign ? "+" : ""),
                  static_cast<unsigned long long>(magnitude / 100U),
                  static_cast<unsigned long long>(magnitude % 100U));
}

void formatTenThousandths(uint32_t value,
                          char* output,
                          std::size_t outputSize) {
    std::snprintf(output,
                  outputSize,
                  "%lu.%04lu",
                  static_cast<unsigned long>(value / 10000U),
                  static_cast<unsigned long>(value % 10000U));
}

void formatIntegerChange(uint32_t current,
                         uint32_t previous,
                         char* output,
                         std::size_t outputSize) {
    const int64_t change =
        static_cast<int64_t>(current) - static_cast<int64_t>(previous);
    std::snprintf(output,
                  outputSize,
                  "%s%llu",
                  change < 0 ? "−" : "+",
                  static_cast<unsigned long long>(
                      change < 0 ? -change : change));
}

void formatFlowChange(uint32_t current,
                      uint32_t previous,
                      char* output,
                      std::size_t outputSize) {
    const int64_t change =
        static_cast<int64_t>(current) - static_cast<int64_t>(previous);
    const uint64_t magnitude =
        static_cast<uint64_t>(change < 0 ? -change : change);
    if (previous == 0) {
        std::snprintf(output,
                      outputSize,
                      "%s%llu.%03llu L/min",
                      change < 0 ? "−" : "+",
                      static_cast<unsigned long long>(magnitude / 1000U),
                      static_cast<unsigned long long>(magnitude % 1000U));
        return;
    }
    const uint64_t percentTenths =
        (magnitude * 1000ULL + previous / 2U) / previous;
    std::snprintf(output,
                  outputSize,
                  "%s%llu.%03llu L/min (%s%llu.%llu%%)",
                  change < 0 ? "−" : "+",
                  static_cast<unsigned long long>(magnitude / 1000U),
                  static_cast<unsigned long long>(magnitude % 1000U),
                  change < 0 ? "−" : "+",
                  static_cast<unsigned long long>(percentTenths / 10U),
                  static_cast<unsigned long long>(percentTenths % 10U));
}

void sendMilliseconds(uint32_t value) {
    char text[24];
    const uint32_t roundedTenths = (value + 50U) / 100U;
    std::snprintf(text,
                  sizeof(text),
                  "%lu.%lu 秒",
                  static_cast<unsigned long>(roundedTenths / 10U),
                  static_cast<unsigned long>(roundedTenths % 10U));
    Esp32BaseWeb::sendChunk(text);
}

void formatPulseRate(uint32_t pulses,
                     uint32_t durationMs,
                     char* output,
                     size_t outputLength) {
    if (!output || outputLength == 0) return;
    if (durationMs == 0) {
        strlcpy(output, "—", outputLength);
        return;
    }
    const uint64_t scaled =
        (static_cast<uint64_t>(pulses) * 100000ULL + durationMs / 2U) /
        durationMs;
    formatSignedHundredths(scaled > INT64_MAX
                               ? INT64_MAX
                               : static_cast<int64_t>(scaled),
                           output,
                           outputLength);
}

uint32_t calculateFlowMlPerMinute(uint32_t pulses,
                                  uint32_t durationMs,
                                  uint32_t pulsesPerLiterX100) {
    if (durationMs == 0 || pulsesPerLiterX100 == 0) return 0;
    const double value = static_cast<double>(pulses) * 6000000000.0 /
                         (static_cast<double>(durationMs) * pulsesPerLiterX100);
    if (value <= 0.0) return 0;
    return value >= UINT32_MAX ? UINT32_MAX
                               : static_cast<uint32_t>(value + 0.5);
}

void sendRecordTime(const Esp32BaseRecordStore::RecordTiming& timing,
                    const char* format = "%m-%d %H:%M") {
    uint32_t epoch = 0;
    char text[32]{};
    if (Esp32BaseRecordStore::resolveCompletedEpoch(timing, epoch) &&
        Esp32BaseTime::formatEpoch(epoch, text, sizeof(text), format)) {
        Esp32BaseWeb::sendChunk(text);
        return;
    }
    Esp32BaseWeb::sendChunk("启动 ");
    sendUnsigned(timing.completedBootId);
    Esp32BaseWeb::sendChunk(" +");
    sendUnsigned(timing.completedUptimeSec);
    Esp32BaseWeb::sendChunk(" 秒");
}

const char* planNameById(const IrrigationConfig* config, uint8_t planId) {
    if (!config || planId == 0 || planId > config->plans.size()) return nullptr;
    const WateringPlan& plan = config->plans[planId - 1U];
    return plan.configured ? plan.name.data() : nullptr;
}

