tangyangguang/Esp32_Irrigation/firmware/src/irrigation/IrrigationWeb.cpp
void sendRecordFlowAlertSummary(const WateringRecordPayload& payload,
                                const IrrigationConfig* config) {
    const uint8_t total = recordFlowAlertZoneCount(payload);
    if (total == 0) {
        Esp32BaseWeb::sendChunk("未触发高低流量报警");
        return;
    }
    if (total > 1) {
        sendUnsigned(total);
        Esp32BaseWeb::sendChunk(" 路曾触发高低流量报警");
        return;
    }
    for (uint8_t index = 0; index < payload.zones.size(); ++index) {
        const ZoneWateringRecord& zone = payload.zones[index];
        if ((zone.flags & (WateringRecordCodec::kZoneFlagLowFlow |
                           WateringRecordCodec::kZoneFlagHighFlow)) == 0) {
            continue;
        }
        if (config) {
            Esp32BaseWeb::writeHtmlEscaped(config->zones[index].name.data());
        } else {
            Esp32BaseWeb::sendChunk("水路 ");
            sendUnsigned(index + 1U);
        }
        const bool low =
            (zone.flags & WateringRecordCodec::kZoneFlagLowFlow) != 0;
        const bool high =
            (zone.flags & WateringRecordCodec::kZoneFlagHighFlow) != 0;
        Esp32BaseWeb::sendChunk(low && high
            ? "曾触发低流量和高流量报警"
            : high ? "曾触发高流量报警" : "曾触发低流量报警");
        return;
    }
}

struct LatestRecordContext {
    bool found = false;
    StoredWateringRecord record{};
};

void collectLatestRecord(const StoredWateringRecord& record, void* user) {
    auto* context = static_cast<LatestRecordContext*>(user);
    if (context && !context->found) {
        context->record = record;
        context->found = true;
    }
}

struct RecordRowsContext {
    const IrrigationConfig* config;
    uint32_t emitted;
};

void sendRecordDetailDialog(const StoredWateringRecord& record,
                            const IrrigationConfig* config,
                            const char* dialogPrefix) {
    const WateringRecordTotals totals = WateringRecordCodec::calculateTotals(record.payload);
    const uint8_t plannedZoneCount = recordPlannedZoneCount(record.payload);
    const uint8_t startedZoneCount = recordStartedZoneCount(record.payload);
    const uint8_t baselineZoneCount = recordBaselineZoneCount(record.payload);
    const uint8_t alertZoneCount = recordFlowAlertZoneCount(record.payload);
    Esp32BaseWeb::sendChunk("<dialog id='");
    Esp32BaseWeb::sendChunk(dialogPrefix);
    sendUnsigned(record.recordId);
    Esp32BaseWeb::sendChunk("' class='panel eb-modal record-detail-dialog' data-eb-light-dismiss='1'><div class='record-detail-head'><div><span class='muted'>");
    sendRecordSource(record.payload, config);
    Esp32BaseWeb::sendChunk("</span><h2>");
    sendRecordTime(record.timing, "%m月%d日 %H:%M");
    Esp32BaseWeb::sendChunk("</h2></div><button type='button' class='secondary record-detail-close' onclick='this.closest(\"dialog\").close()'>关闭</button></div><div class='record-detail-result'><span class='tag ");
    Esp32BaseWeb::sendChunk(recordOutcomeTone(record.payload));
    Esp32BaseWeb::sendChunk("'>");
    Esp32BaseWeb::sendChunk(recordOutcomeName(record.payload));
    Esp32BaseWeb::sendChunk("</span><span>");
    sendRecordOutcomeSummary(record.payload, config);
    Esp32BaseWeb::sendChunk("</span></div><div class='record-detail-metrics'><div><span>实际浇水</span><b>");
    sendDuration(totals.actualWateringSec);
    Esp32BaseWeb::sendChunk("</b></div><div><span>估算用水量</span><b>");
    if (recordHasCappedEstimate(record.payload)) {
        Esp32BaseWeb::sendChunk("至少 ");
    }
    sendWaterVolume(totals.estimatedWaterMl);
    Esp32BaseWeb::sendChunk("</b></div><div><span>执行水路</span><b>");
    sendUnsigned(startedZoneCount);
    Esp32BaseWeb::sendChunk(" / ");
    sendUnsigned(plannedZoneCount);
    Esp32BaseWeb::sendChunk(" 路</b></div><div><span>高低流量报警</span><b>");
    if (alertZoneCount == 0) {
        Esp32BaseWeb::sendChunk("无");
    } else {
        sendUnsigned(alertZoneCount);
        Esp32BaseWeb::sendChunk(" 路");
    }
    Esp32BaseWeb::sendChunk("</b><small>");
    sendUnsigned(baselineZoneCount);
    Esp32BaseWeb::sendChunk(" / ");
    sendUnsigned(startedZoneCount);
    Esp32BaseWeb::sendChunk(" 路设置了基准</small></div></div><div class='record-detail-section'><h3>执行时间</h3><div class='record-detail-grid'><div class='record-time-range'><b>开始 — 完成</b><span>");
    sendRecordTimeRange(record.timing);
    Esp32BaseWeb::sendChunk("</span></div><div><b>执行目标</b><span>");
    const uint32_t targetWaterMl = recordTargetWaterMl(record.payload);
    if (targetWaterMl != 0) sendWaterVolume(targetWaterMl);
    else sendDuration(totals.plannedDurationSec);
    Esp32BaseWeb::sendChunk("</span></div><div><b>任务总历时</b><span>");
    sendDuration(record.timing.durationSec);
    Esp32BaseWeb::sendChunk("</span></div></div></div><div class='record-detail-section'><h3>水路明细</h3><p>计划和水路名称按当前设置显示；流量、基准和用水量均保留浇水当时的记录。</p><div class='tablewrap'><table class='record-zone-table'><thead><tr><th>水路</th><th>执行结果</th><th>实际 / 目标</th><th>估算用水量</th><th>当时基准流量</th><th>流量表现</th></tr></thead><tbody>");
    for (uint8_t index = 0; index < record.payload.zones.size(); ++index) {
        const ZoneWateringRecord& zone = record.payload.zones[index];
        if (zone.plannedDurationSec == 0) continue;
        Esp32BaseWeb::sendChunk("<tr><td data-label='水路'><b>");
        if (config) {
            Esp32BaseWeb::writeHtmlEscaped(config->zones[index].name.data());
        } else {
            Esp32BaseWeb::sendChunk("水路 ");
            sendUnsigned(index + 1U);
        }
        Esp32BaseWeb::sendChunk("</b></td><td data-label='执行结果'>");
        Esp32BaseWeb::sendChunk(zoneResultName(zone.result));
        Esp32BaseWeb::sendChunk("</td><td data-label='实际 / 目标' class='record-duration-pair'><b>");
        sendDuration(zone.actualWateringSec);
        Esp32BaseWeb::sendChunk("</b><span>/</span><small>");
        if (zone.targetWaterMl != 0) sendWaterVolume(zone.targetWaterMl);
        else sendDuration(zone.plannedDurationSec);
        Esp32BaseWeb::sendChunk("</small></td><td data-label='估算用水量'>");
        if ((zone.flags & WateringRecordCodec::kZoneFlagWaterEstimateCapped) != 0) {
            Esp32BaseWeb::sendChunk("至少 ");
        }
        sendWaterVolume(zone.estimatedWaterMl);
        if ((zone.flags & WateringRecordCodec::kZoneFlagWaterEstimateCapped) != 0) {
            Esp32BaseWeb::sendChunk("<small class='warn'>达到记录上限</small>");
        }
        Esp32BaseWeb::sendChunk("</td><td data-label='当时基准流量' class='record-baseline'>");
        const bool baselineAvailable =
            (zone.flags &
             WateringRecordCodec::kZoneFlagFlowBaselineAvailable) != 0;
        if (zone.result == ZoneWateringResult::NotStarted) {
            Esp32BaseWeb::sendChunk("<span class='muted'>—</span>");
        } else if (baselineAvailable) {
            sendFlowRate(zone.baselineFlowMlPerMinute);
        } else {
            Esp32BaseWeb::sendChunk("<span class='muted'>未设置</span><small>本次不进行高低流量判定</small>");
        }
        Esp32BaseWeb::sendChunk("</td><td data-label='流量表现'><div class='record-flow-performance'>");
        if (zone.result == ZoneWateringResult::NotStarted) {
            Esp32BaseWeb::sendChunk("<span class='muted'>—</span>");
        } else if (zone.actualWateringSec == 0) {
            Esp32BaseWeb::sendChunk("<span class='muted'>未建立有效水流</span>");
        } else {
            Esp32BaseWeb::sendChunk("<span>整段平均 ");
            sendFlowRate(zone.averageFlowMlPerMinute);
            if (baselineAvailable) {
                char comparison[48]{};
                formatFlowChange(zone.averageFlowMlPerMinute,
                                 zone.baselineFlowMlPerMinute,
                                 comparison,
                                 sizeof(comparison));
                Esp32BaseWeb::sendChunk("，较基准 ");
                Esp32BaseWeb::writeHtmlEscaped(comparison);
            }
            Esp32BaseWeb::sendChunk("</span>");
            Esp32BaseWeb::sendChunk(
                "<span class='muted'>本地记录仅保留整段平均流量</span>");
        }
        Esp32BaseWeb::sendChunk("<div class='record-flags'>");
        if ((zone.flags & WateringRecordCodec::kZoneFlagLowFlow) != 0) {
            Esp32BaseWeb::sendChunk("<span class='tag warn'>曾触发低流量报警</span>");
        }
        if ((zone.flags & WateringRecordCodec::kZoneFlagHighFlow) != 0) {
            Esp32BaseWeb::sendChunk("<span class='tag danger'>曾触发高流量报警</span>");
        }
        if ((zone.flags & (WateringRecordCodec::kZoneFlagLowFlow |
                           WateringRecordCodec::kZoneFlagHighFlow)) == 0 &&
            baselineAvailable) {
            Esp32BaseWeb::sendChunk("<span class='tag ok'>未触发高低流量报警</span>");
        }
        Esp32BaseWeb::sendChunk("</div></div></td></tr>");
    }
    Esp32BaseWeb::sendChunk("</tbody></table></div><p class='record-detail-note'>相对基准差值用于解释流量表现，不等同于报警结果；报警以浇水当时的阈值和连续判定结果为准。</p></div><details class='record-technical'><summary>指标与技术说明</summary><p class='record-technical-note'>整段平均只统计水流建立后的实际浇水阶段；末段流量来自结束前最多 5 个完整的 5 秒窗口，“未确认稳定”可能是窗口不足或波动较大；估算用水量还包含建立水流和关阀尾水阶段的实际脉冲。</p><div class='record-technical-grid'><div><b>总脉冲</b><span>");
    sendUnsigned64(totals.pulseCount);
    Esp32BaseWeb::sendChunk("</span></div>");
    for (uint8_t index = 0; index < record.payload.zones.size(); ++index) {
        const ZoneWateringRecord& zone = record.payload.zones[index];
        if (zone.plannedDurationSec == 0) continue;
        Esp32BaseWeb::sendChunk("<div><b>");
        if (config) {
            Esp32BaseWeb::writeHtmlEscaped(config->zones[index].name.data());
        } else {
            Esp32BaseWeb::sendChunk("水路 ");
            sendUnsigned(index + 1U);
        }
        Esp32BaseWeb::sendChunk("</b><span>");
        sendUnsigned(zone.pulseCount);
        Esp32BaseWeb::sendChunk(" 脉冲</span></div>");
    }
    Esp32BaseWeb::sendChunk("</div></details><div class='actions record-detail-bottom-close'><button type='button' class='secondary' onclick='this.closest(\"dialog\").close()'>关闭</button></div></dialog>");
}

void sendRecordRow(const StoredWateringRecord& record, void* user) {
    RecordRowsContext* context = static_cast<RecordRowsContext*>(user);
    const WateringRecordTotals totals = WateringRecordCodec::calculateTotals(record.payload);
    if (context) ++context->emitted;
    Esp32BaseWeb::sendChunk("<tr><td data-label='完成时间' class='record-time'>");
    sendRecordTime(record.timing);
    Esp32BaseWeb::sendChunk("</td><td data-label='浇水任务'>");
    sendRecordSource(record.payload, context ? context->config : nullptr);
    Esp32BaseWeb::sendChunk("</td><td data-label='执行水路' class='record-zones'>");
    sendRecordWateredZones(record.payload, context ? context->config : nullptr);
    Esp32BaseWeb::sendChunk("</td><td data-label='执行结果'><span class='tag ");
    Esp32BaseWeb::sendChunk(recordOutcomeTone(record.payload));
    Esp32BaseWeb::sendChunk("'>");
    Esp32BaseWeb::sendChunk(recordOutcomeName(record.payload));
    Esp32BaseWeb::sendChunk("</span>");
    if (record.payload.result != WateringResult::Completed) {
        Esp32BaseWeb::sendChunk("<small class='record-result-reason'>");
        sendRecordOutcomeSummary(
            record.payload, context ? context->config : nullptr);
        Esp32BaseWeb::sendChunk("</small>");
    } else if (recordHasFlowAlert(record.payload)) {
        Esp32BaseWeb::sendChunk("<small class='record-result-reason'>");
        sendRecordFlowAlertSummary(
            record.payload, context ? context->config : nullptr);
        Esp32BaseWeb::sendChunk("</small>");
    }
    Esp32BaseWeb::sendChunk("</td><td data-label='实际 / 目标' class='record-number record-list-duration'><span>");
    sendDuration(totals.actualWateringSec);
    Esp32BaseWeb::sendChunk("</span><small>/ ");
    const uint32_t targetWaterMl = recordTargetWaterMl(record.payload);
    if (targetWaterMl != 0) sendCompactWaterVolume(targetWaterMl);
    else sendDuration(totals.plannedDurationSec);
    Esp32BaseWeb::sendChunk("</small></td><td data-label='估算用水量' class='record-number'>");
    if (recordHasCappedEstimate(record.payload)) Esp32BaseWeb::sendChunk("至少 ");
    sendCompactWaterVolume(totals.estimatedWaterMl);
    Esp32BaseWeb::sendChunk("</td><td data-label='操作' class='record-action'><button type='button' class='btnlink info compact' onclick=\"document.getElementById('record-detail-");
    sendUnsigned(record.recordId);
    Esp32BaseWeb::sendChunk("').showModal()\">查看详情</button>");
    sendRecordDetailDialog(record, context ? context->config : nullptr, "record-detail-");
    Esp32BaseWeb::sendChunk("</td></tr>");
}

struct EventFilter {
    uint8_t level = 0;
    int8_t category = -1;
    char query[64]{};
};

struct EventRowsContext {
    const EventFilter* filter;
    const IrrigationConfig* config;
    uint32_t offset;
    uint32_t limit;
    uint32_t matched;
    uint32_t emitted;
};

