tangyangguang/Esp32_Irrigation/firmware/src/irrigation/IrrigationWeb.cpp
const char* eventToneClass(IrrigationEvents::Level level) {
    switch (level) {
        case IrrigationEvents::Level::Warning: return "warn";
        case IrrigationEvents::Level::Error: return "danger";
        case IrrigationEvents::Level::Info:
        default: return "info";
    }
}

const char* conditionStateName(
    IrrigationEvents::ConditionDisplayState state) {
    switch (state) {
        case IrrigationEvents::ConditionDisplayState::Normal: return "正常";
        case IrrigationEvents::ConditionDisplayState::Active: return "异常中";
        case IrrigationEvents::ConditionDisplayState::ConfirmingActivation:
            return "异常确认中";
        case IrrigationEvents::ConditionDisplayState::ConfirmingRecovery:
            return "恢复确认中";
        case IrrigationEvents::ConditionDisplayState::Unknown:
        default: return "等待判断";
    }
}

const char* conditionStateTone(
    IrrigationEvents::ConditionDisplayState state) {
    switch (state) {
        case IrrigationEvents::ConditionDisplayState::Normal: return "ok";
        case IrrigationEvents::ConditionDisplayState::Active: return "danger";
        case IrrigationEvents::ConditionDisplayState::ConfirmingActivation:
        case IrrigationEvents::ConditionDisplayState::ConfirmingRecovery:
            return "warn";
        case IrrigationEvents::ConditionDisplayState::Unknown:
        default: return "info";
    }
}

void sendEventTime(const Esp32BaseRecordStore::RecordTiming& timing) {
    uint32_t epoch = 0;
    char text[32]{};
    if (Esp32BaseRecordStore::resolveCompletedEpoch(timing, epoch) &&
        Esp32BaseTime::formatEpoch(epoch, text, sizeof(text), "%m-%d %H:%M:%S")) {
        Esp32BaseWeb::sendChunk(text);
        return;
    }
    Esp32BaseWeb::sendChunk("设备启动后 ");
    sendUnsigned(timing.completedUptimeSec);
    Esp32BaseWeb::sendChunk(" 秒");
}

bool eventMatches(const IrrigationEvents::EventRecord& event,
                  const EventFilter& filter) {
    if (filter.level != 0 && static_cast<uint8_t>(event.level) != filter.level) return false;
    return filter.category < 0 ||
           static_cast<uint8_t>(IrrigationEvents::category(event)) ==
               static_cast<uint8_t>(filter.category);
}

void sendEventDetailDialog(const IrrigationEvents::EventRecord& event,
                           const char* dialogId,
                           const IrrigationConfig* config) {
    char title[192]{};
    char summary[160]{};
    const uint8_t planId = IrrigationEvents::wateringPlanId(event);
    const char* eventPlanName = planNameById(config, planId);
    const char* eventZoneName =
        config && event.objectId >= 1 &&
                event.objectId <= BoardPins::kZoneCount
            ? config->zones[BoardPins::zoneIndex(
                  static_cast<uint8_t>(event.objectId))].name.data()
            : nullptr;
    IrrigationEvents::formatTitle(event,
                                  title,
                                  sizeof(title),
                                  eventPlanName,
                                  eventZoneName);
    IrrigationEvents::formatSummary(event, summary, sizeof(summary));
    Esp32BaseWeb::sendChunk("<dialog id='");
    Esp32BaseWeb::sendChunk(dialogId);
    Esp32BaseWeb::sendChunk("' class='panel eb-modal event-detail' data-eb-light-dismiss='1'><div class='event-detail-head'><div class='event-detail-heading'><span class='tag ");
    Esp32BaseWeb::sendChunk(eventToneClass(event.level));
    Esp32BaseWeb::sendChunk("'>");
    Esp32BaseWeb::sendChunk(IrrigationEvents::levelName(event.level));
    Esp32BaseWeb::sendChunk("</span><h2>");
    Esp32BaseWeb::writeHtmlEscaped(title);
    Esp32BaseWeb::sendChunk("</h2></div><button type='button' class='secondary compact event-detail-close' onclick='this.closest(\"dialog\").close()'>关闭</button></div><p class='event-detail-summary'>");
    Esp32BaseWeb::writeHtmlEscaped(summary);
    Esp32BaseWeb::sendChunk("</p><section class='event-detail-section'><h3>事件概况</h3><div class='event-detail-grid event-detail-overview'><div><b>发生时间</b><span class='event-time-value'>");
    sendEventTime(event.timing);
    Esp32BaseWeb::sendChunk("</span></div><div><b>严重程度</b><span><span class='tag ");
    Esp32BaseWeb::sendChunk(eventToneClass(event.level));
    Esp32BaseWeb::sendChunk("'>");
    Esp32BaseWeb::sendChunk(IrrigationEvents::levelName(event.level));
    Esp32BaseWeb::sendChunk("</span></span></div><div><b>业务分类</b><span>");
    Esp32BaseWeb::sendChunk(IrrigationEvents::categoryName(IrrigationEvents::category(event)));
    Esp32BaseWeb::sendChunk("</span></div></div></section>");
    const IrrigationEvents::EventCode eventCode =
        static_cast<IrrigationEvents::EventCode>(event.eventCode);
    if (eventCode == IrrigationEvents::EventCode::WateringStoppedAbnormally) {
        Esp32BaseWeb::sendChunk("<section class='event-detail-section'><h3>关联浇水</h3><div class='event-detail-grid event-detail-business'><div><b>来源</b><span>");
        if (!IrrigationEvents::hasWateringContext(event)) {
            Esp32BaseWeb::sendChunk("未记录");
        } else if (IrrigationEvents::wateringSource(event) ==
            WateringSource::AutomaticPlan) {
            Esp32BaseWeb::sendChunk("自动计划");
            if (eventPlanName) {
                Esp32BaseWeb::sendChunk(" · ");
                Esp32BaseWeb::writeHtmlEscaped(eventPlanName);
            } else {
                Esp32BaseWeb::sendChunk(" ");
                sendUnsigned(planId);
                Esp32BaseWeb::sendChunk("（已删除）");
            }
        } else {
            Esp32BaseWeb::sendChunk(sourceName(IrrigationEvents::wateringSource(event)));
        }
        Esp32BaseWeb::sendChunk("</span></div><div><b>发生问题的水路</b><span>");
        if (event.objectId == 0) {
            Esp32BaseWeb::sendChunk("整次任务");
        } else if (eventZoneName) {
            Esp32BaseWeb::writeHtmlEscaped(eventZoneName);
            Esp32BaseWeb::sendChunk("（水路 ");
            sendUnsigned(event.objectId);
            Esp32BaseWeb::sendChunk("）");
        } else {
            Esp32BaseWeb::sendChunk("水路 ");
            sendUnsigned(event.objectId);
        }
        Esp32BaseWeb::sendChunk("</span></div><div><b>实际浇水</b><span>");
        sendDuration(event.value2 < 0 ? 0 : static_cast<uint32_t>(event.value2));
        Esp32BaseWeb::sendChunk("</span></div></div><div class='actions'><a class='btnlink secondary compact' href='/irrigation/records'>查看浇水记录</a></div></section>");
    } else if (eventCode == IrrigationEvents::EventCode::FlowDeviation) {
        const uint32_t actual =
            event.value1 < 0 ? 0 : static_cast<uint32_t>(event.value1);
        const uint32_t baseline =
            event.value2 < 0 ? 0 : static_cast<uint32_t>(event.value2);
        char comparison[48]{};
        formatFlowChange(actual, baseline, comparison, sizeof(comparison));
        Esp32BaseWeb::sendChunk("<section class='event-detail-section'><h3>流量判断</h3><div class='event-detail-grid event-detail-business'><div><b>来源</b><span>");
        if (!IrrigationEvents::hasWateringContext(event)) {
            Esp32BaseWeb::sendChunk("未记录");
        } else if (IrrigationEvents::wateringSource(event) ==
            WateringSource::AutomaticPlan) {
            Esp32BaseWeb::sendChunk("自动计划");
            if (eventPlanName) {
                Esp32BaseWeb::sendChunk(" · ");
                Esp32BaseWeb::writeHtmlEscaped(eventPlanName);
            } else {
                Esp32BaseWeb::sendChunk(" ");
                sendUnsigned(planId);
            }
        } else {
            Esp32BaseWeb::sendChunk(sourceName(IrrigationEvents::wateringSource(event)));
        }
        Esp32BaseWeb::sendChunk("</span></div><div><b>水路</b><span>");
        if (eventZoneName) {
            Esp32BaseWeb::writeHtmlEscaped(eventZoneName);
            Esp32BaseWeb::sendChunk("（水路 ");
            sendUnsigned(event.objectId);
            Esp32BaseWeb::sendChunk("）");
        } else {
            Esp32BaseWeb::sendChunk("水路 ");
            sendUnsigned(event.objectId);
        }
        Esp32BaseWeb::sendChunk("</span></div><div><b>检测流量</b><span>");
        sendFlowRate(actual);
        Esp32BaseWeb::sendChunk("</span></div><div><b>当时基准流量</b><span>");
        sendFlowRate(baseline);
        Esp32BaseWeb::sendChunk("</span></div><div><b>相对基准</b><span>");
        Esp32BaseWeb::writeHtmlEscaped(comparison);
        Esp32BaseWeb::sendChunk("</span></div><div><b>处理结果</b><span>");
        Esp32BaseWeb::sendChunk(
            (event.flags & (1U << 1U)) != 0 ? "已停止本次浇水"
                                            : "继续本次浇水");
        Esp32BaseWeb::sendChunk("</span></div></div></section>");
    } else if (eventCode == IrrigationEvents::EventCode::ClosedValveFlow) {
        Esp32BaseWeb::sendChunk("<section class='event-detail-section'><h3>相关数据</h3><div class='event-detail-grid event-detail-business'><div><b>窗口脉冲</b><span>");
        sendUnsigned(event.value1 < 0 ? 0 : static_cast<uint32_t>(event.value1));
        Esp32BaseWeb::sendChunk(" 个</span></div><div><b>检测窗口</b><span>");
        sendUnsigned(event.value2 < 0 ? 0 : static_cast<uint32_t>(event.value2));
        Esp32BaseWeb::sendChunk(" 秒</span></div><div><b>报警阈值</b><span>");
        sendUnsigned(event.objectId);
        Esp32BaseWeb::sendChunk(" 个脉冲</span></div></div></section>");
    } else if (eventCode == IrrigationEvents::EventCode::FlowCalibrationSaved) {
        const uint32_t previous =
            event.value1 < 0 ? 0 : static_cast<uint32_t>(event.value1);
        const uint32_t coefficient =
            event.value2 < 0 ? 0 : static_cast<uint32_t>(event.value2);
        char previousText[24]{};
        char coefficientText[24]{};
        std::snprintf(previousText, sizeof(previousText), "%lu.%02lu P/L",
                      static_cast<unsigned long>(previous / 100U),
                      static_cast<unsigned long>(previous % 100U));
        std::snprintf(coefficientText, sizeof(coefficientText), "%lu.%02lu P/L",
                      static_cast<unsigned long>(coefficient / 100U),
                      static_cast<unsigned long>(coefficient % 100U));
        Esp32BaseWeb::sendChunk("<section class='event-detail-section'><h3>参数变化</h3><div class='event-detail-grid event-detail-business'><div><b>原稳态流量系数</b><span>");
        Esp32BaseWeb::sendChunk(previousText);
        Esp32BaseWeb::sendChunk("</span></div><div><b>新稳态流量系数</b><span>");
        Esp32BaseWeb::sendChunk(coefficientText);
        Esp32BaseWeb::sendChunk("</span></div></div></section>");
    } else if (eventCode == IrrigationEvents::EventCode::ZoneFlowSaved) {
        char previousFlow[20]{};
        char flow[20]{};
        IrrigationConfigRules::formatLitersPerMinute(
            event.value1 < 0 ? 0 : static_cast<uint32_t>(event.value1),
            previousFlow, sizeof(previousFlow));
        IrrigationConfigRules::formatLitersPerMinute(
            event.value2 < 0 ? 0 : static_cast<uint32_t>(event.value2),
            flow, sizeof(flow));
        Esp32BaseWeb::sendChunk("<section class='event-detail-section'><h3>相关数据</h3><div class='event-detail-grid event-detail-business'><div><b>水路</b><span>");
        sendUnsigned(event.objectId);
        Esp32BaseWeb::sendChunk("</span></div><div><b>原基准流量</b><span>");
        if (event.value1 == 0) {
            Esp32BaseWeb::sendChunk("未设置");
        } else {
            Esp32BaseWeb::sendChunk(previousFlow);
            Esp32BaseWeb::sendChunk(" L/min");
        }
        Esp32BaseWeb::sendChunk("</span></div><div><b>新基准流量</b><span>");
        if (event.value2 == 0) {
            Esp32BaseWeb::sendChunk("已清除");
        } else {
            Esp32BaseWeb::sendChunk(flow);
            Esp32BaseWeb::sendChunk(" L/min");
        }
        Esp32BaseWeb::sendChunk("</span></div></div></section>");
    } else if (eventCode == IrrigationEvents::EventCode::AutomaticPlanSkipped) {
        Esp32BaseWeb::sendChunk("<section class='event-detail-section'><h3>相关对象</h3><div class='event-detail-grid event-detail-business'><div><b>计划</b><span>");
        if (eventPlanName) {
            Esp32BaseWeb::writeHtmlEscaped(eventPlanName);
            Esp32BaseWeb::sendChunk("（计划 ");
            sendUnsigned(event.objectId);
            Esp32BaseWeb::sendChunk("）");
        } else {
            Esp32BaseWeb::sendChunk("计划 ");
            sendUnsigned(event.objectId);
        }
        Esp32BaseWeb::sendChunk("</span></div></div></section>");
    } else if (eventCode == IrrigationEvents::EventCode::ConfigurationChanged &&
               event.objectId != 0) {
        const IrrigationEvents::ReasonCode reason =
            static_cast<IrrigationEvents::ReasonCode>(event.reasonCode);
        const bool zoneChanged = reason == IrrigationEvents::ReasonCode::ZoneUpdated;
        Esp32BaseWeb::sendChunk("<section class='event-detail-section'><h3>相关对象</h3><div class='event-detail-grid event-detail-business'><div><b>");
        Esp32BaseWeb::sendChunk(zoneChanged ? "水路" : "计划");
        Esp32BaseWeb::sendChunk("</b><span>");
        sendUnsigned(event.objectId);
        Esp32BaseWeb::sendChunk("</span></div></div></section>");
    }
    Esp32BaseWeb::sendChunk("<details class='event-technical'><summary>技术信息</summary><div class='event-detail-grid event-detail-technical-grid'><div><b>记录编号</b><span>#");
    sendUnsigned(event.recordId);
    Esp32BaseWeb::sendChunk("</span></div><div><b>事件码</b><span>");
    sendUnsigned(event.eventCode);
    Esp32BaseWeb::sendChunk("</span></div><div><b>原因码</b><span>");
    sendUnsigned(event.reasonCode);
    Esp32BaseWeb::sendChunk("</span></div><div><b>对象 ID</b><span>");
    sendUnsigned(event.objectId);
    Esp32BaseWeb::sendChunk("</span></div><div><b>数值 1</b><span>");
    char signedValue[20];
    std::snprintf(signedValue, sizeof(signedValue), "%ld", static_cast<long>(event.value1));
    Esp32BaseWeb::sendChunk(signedValue);
    Esp32BaseWeb::sendChunk("</span></div><div><b>数值 2</b><span>");
    std::snprintf(signedValue, sizeof(signedValue), "%ld", static_cast<long>(event.value2));
    Esp32BaseWeb::sendChunk(signedValue);
    Esp32BaseWeb::sendChunk("</span></div><div><b>标记</b><span>");
    sendUnsigned(event.flags);
    Esp32BaseWeb::sendChunk("</span></div><div><b>条件 ID</b><span>");
    sendUnsigned(event.conditionId);
    Esp32BaseWeb::sendChunk("</span></div><div><b>事件类型</b><span>");
    sendUnsigned(static_cast<uint32_t>(event.eventKind));
    Esp32BaseWeb::sendChunk("</span></div><div><b>启动编号</b><span>");
    sendUnsigned(event.timing.completedBootId);
    Esp32BaseWeb::sendChunk("</span></div><div><b>启动后时间</b><span>");
    sendUnsigned(event.timing.completedUptimeSec);
    Esp32BaseWeb::sendChunk(" 秒</span></div><div><b>持续时间</b><span>");
    sendUnsigned(event.timing.durationSec);
    Esp32BaseWeb::sendChunk(" 秒</span></div></div></details></dialog>");
}

void sendEventRow(const IrrigationEvents::EventRecord& event, void* user) {
    EventRowsContext* context = static_cast<EventRowsContext*>(user);
    if (!context || !context->filter || !eventMatches(event, *context->filter)) return;
    const uint32_t index = context->matched++;
    if (index < context->offset || context->emitted >= context->limit) return;
    ++context->emitted;
    char title[192]{};
    char summary[160]{};
    char dialogId[28]{};
    const uint8_t planId = IrrigationEvents::wateringPlanId(event);
    const char* eventPlanName = planNameById(context->config, planId);
    const char* eventZoneName =
        context->config && event.objectId >= 1 &&
                event.objectId <= BoardPins::kZoneCount
            ? context->config->zones[BoardPins::zoneIndex(
                  static_cast<uint8_t>(event.objectId))].name.data()
            : nullptr;
    IrrigationEvents::formatTitle(event,
                                  title,
                                  sizeof(title),
                                  eventPlanName,
                                  eventZoneName);
    IrrigationEvents::formatSummary(event, summary, sizeof(summary));
    std::snprintf(dialogId, sizeof(dialogId), "event-detail-%lu",
                  static_cast<unsigned long>(event.recordId));
    Esp32BaseWeb::sendChunk("<tr><td data-label='时间' class='event-time'>");
    sendEventTime(event.timing);
    Esp32BaseWeb::sendChunk("</td><td data-label='等级' class='event-level'><span class='tag ");
    Esp32BaseWeb::sendChunk(eventToneClass(event.level));
    Esp32BaseWeb::sendChunk("'>");
    Esp32BaseWeb::sendChunk(IrrigationEvents::levelName(event.level));
    Esp32BaseWeb::sendChunk("</span></td><td data-label='分类' class='event-category'>");
    Esp32BaseWeb::sendChunk(IrrigationEvents::categoryName(IrrigationEvents::category(event)));
    Esp32BaseWeb::sendChunk("</td><td data-label='事件' class='event-title'>");
    Esp32BaseWeb::writeHtmlEscaped(title);
    Esp32BaseWeb::sendChunk("</td><td data-label='说明' class='event-summary'>");
    Esp32BaseWeb::writeHtmlEscaped(summary);
    Esp32BaseWeb::sendChunk("</td><td data-label='操作' class='event-action'><button type='button' class='btnlink info compact' onclick=\"document.getElementById('");
    Esp32BaseWeb::sendChunk(dialogId);
    Esp32BaseWeb::sendChunk("').showModal()\">查看详情</button>");
    sendEventDetailDialog(event, dialogId, context->config);
    Esp32BaseWeb::sendChunk("</td></tr>");
}

}  // namespace

bool IrrigationWeb::registerRoutes(IrrigationApp& app) {
    g_app = &app;
    Esp32BaseWeb::setDeviceName("智能浇水");
    Esp32BaseWeb::setHomeMode(Esp32BaseWeb::HOME_APP);
    Esp32BaseWeb::setHomePath("/irrigation");
    return Esp32BaseWeb::addPage("/irrigation", "首页", overview) &&
           Esp32BaseWeb::addPage("/irrigation/plans", "计划", plans) &&
           Esp32BaseWeb::addPage("/irrigation/zones", "水路", zones) &&
           Esp32BaseWeb::addPage("/irrigation/records", "记录", records) &&
           Esp32BaseWeb::addPage("/irrigation/events", "事件", events) &&
           Esp32BaseWeb::addPage("/irrigation/settings", "设置", settings) &&
           Esp32BaseWeb::addRoute("/irrigation", Esp32BaseWeb::METHOD_POST, overview) &&
           Esp32BaseWeb::addRoute("/irrigation/plans", Esp32BaseWeb::METHOD_POST, plans) &&
           Esp32BaseWeb::addRoute("/irrigation/zones", Esp32BaseWeb::METHOD_POST, zones) &&
           Esp32BaseWeb::addRoute("/irrigation/zones/flow-calibration",
                                  Esp32BaseWeb::METHOD_GET,
                                  flowCalibration) &&
           Esp32BaseWeb::addRoute("/irrigation/zones/flow-calibration",
                                  Esp32BaseWeb::METHOD_POST,
                                  flowCalibration) &&
           Esp32BaseWeb::addRoute("/irrigation/zones/learning",
                                  Esp32BaseWeb::METHOD_GET,
                                  zoneLearning) &&
           Esp32BaseWeb::addRoute("/irrigation/zones/learning",
                                  Esp32BaseWeb::METHOD_POST,
                                  zoneLearning) &&
           Esp32BaseWeb::addApi("/irrigation/api/status", statusApi) &&
           Esp32BaseWeb::addApi("/irrigation/api/flow-history", flowHistoryApi);
}

void IrrigationWeb::overview() {
    if (Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_POST)) {
        if (!Esp32BaseWeb::checkPostAllowed("irrigation_manual_watering")) return;
        bool success = false;
        if (actionIs("stop")) {
            const WateringStatus status = g_app->wateringStatus();
            success = status.active && status.purpose == WateringPurpose::Normal &&
                      g_app->stopWatering();
        } else if (actionIs("start_zones")) {
            std::array<uint16_t, BoardPins::kZoneCount> durations{};
            success = true;
            for (uint8_t index = 0; index < durations.size(); ++index) {
                char name[8];
                std::snprintf(name, sizeof(name), "zone%u", index + 1U);
                uint32_t duration = 0;
                if (Esp32BaseWeb::hasParam(name) &&
                    (!g_app->configuration() ||
                     !uintParam(name,
                                0,
                                g_app->configuration()->runLimits.maximumZoneDurationMinutes,
                                duration))) {
                    success = false;
                    break;
                }
                durations[index] = static_cast<uint16_t>(duration);
            }
            success = success && g_app->startManualWatering(durations) ==
                                     WateringStartResult::Started;
        }
        redirectResult("/irrigation", success);
        return;
    }
    const WateringStatus watering = g_app->wateringStatus();
    if (watering.active) {
        activeTask();
        return;
    }
    if (!Esp32BaseWeb::checkAuth()) return;
    Esp32BaseWeb::sendHeader("智能浇水");
    IrrigationWebAssets::send(IrrigationWebAssets::Asset::HomeStyle);
    const AutomaticWateringState automatic = g_app->automaticWateringState();
    const Esp32BaseTime::Snapshot now = Esp32BaseTime::snapshot();
    const WateringScheduler::TimeState schedulerTime = g_app->schedulerTimeState();
    const bool timeTrusted = now.synced && schedulerTime == WateringScheduler::TimeState::Ready;
    const bool storageFault = g_app->recordStorageFault() || g_app->eventStorageFault() ||
                              g_app->schedulerStorageFault() || g_app->checkpointStorageFault();
    const IrrigationEvents::ConditionDisplayState rtcCondition =
        g_app->eventConditionState(1);
    const bool rtcUnavailable =
        rtcCondition == IrrigationEvents::ConditionDisplayState::Active ||
        rtcCondition == IrrigationEvents::ConditionDisplayState::ConfirmingRecovery;
    const IrrigationConfig* config = g_app->configuration();
    bool hasEnabledZone = false;
    if (config) {
        for (const ZoneConfig& zone : config->zones) {
            if (zone.enabled) hasEnabledZone = true;
        }
    }
    const NextAutomaticWatering next = g_app->nextAutomaticWatering();
    LatestRecordContext latest;
    if (!g_app->recordStorageFault()) {
        g_app->readLatestWateringRecords(0, 1, collectLatestRecord, &latest);
    }
    char value[96]{};
    char secondary[96]{};

    char result[12]{};
    if (getParam("result", result, sizeof(result))) {
        if (std::strcmp(result, "ok") == 0) {
            Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_OK, "操作已完成");
        } else if (std::strcmp(result, "error") == 0) {
            Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_DANGER, "操作失败",
                                     "请检查设备时间和当前状态后重试。");
        }
    }

