tangyangguang/Esp32_Irrigation/firmware/src/irrigation/IrrigationWeb.cpp
            Esp32BaseWeb::sendChunk("'><small>用于计划、运行和记录页面显示。</small></p><p class='field full'><label><input type='checkbox' name='enabled' value='1' "); if (zone.enabled) Esp32BaseWeb::sendChunk("checked");
            Esp32BaseWeb::sendChunk("> 启用这条水路</label><small>未安装的水路保持关闭，正常使用页面不会显示。</small></p></div><div class='actions'><button type='button' class='secondary' onclick='this.closest(\"dialog\").close()'>取消</button><input type='submit' value='保存'></div></form>");
            Esp32BaseWeb::sendChunk("</dialog>");
        }
    }
    endPage();
}

void IrrigationWeb::flowCalibration() {
    if (Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_POST)) {
        if (!Esp32BaseWeb::checkPostAllowed("irrigation_flow_calibration")) return;
        bool success = false;
        const WateringStatus status = g_app->wateringStatus();
        if (actionIs("start")) {
            uint32_t zoneId = 0;
            char stopMode[12]{};
            success = uintParam("zone_id", 1, BoardPins::kZoneCount, zoneId) &&
                      getParam("stop_mode", stopMode, sizeof(stopMode));
            uint32_t durationMinutes = 10;
            uint32_t targetWaterMl = 0;
            if (success && std::strcmp(stopMode, "time") == 0) {
                success = uintParam("duration_minutes", 1, 10, durationMinutes);
            } else if (success && std::strcmp(stopMode, "volume") == 0) {
                char targetLiters[20]{};
                success = getParam("target_liters", targetLiters, sizeof(targetLiters)) &&
                          IrrigationConfigRules::parseWaterVolumeLiters(
                              targetLiters, targetWaterMl);
            } else {
                success = false;
            }
            success = success &&
                      g_app->startFlowCalibration(static_cast<uint8_t>(zoneId),
                                                  static_cast<uint16_t>(durationMinutes),
                                                  targetWaterMl) ==
                          WateringStartResult::Started;
        } else if (actionIs("stop")) {
            success = status.active && status.purpose == WateringPurpose::FlowCalibration &&
                      g_app->stopWatering();
        } else if (actionIs("measurement")) {
            uint32_t measuredMl = 0;
            success = uintParam("measured_ml",
                                FlowCalibrationService::kMinimumMeasuredWaterMl,
                                FlowCalibrationService::kMaximumMeasuredWaterMl,
                                measuredMl) &&
                      g_app->submitFlowCalibrationMeasurement(measuredMl);
        } else if (actionIs("invalid")) {
            success = g_app->markFlowCalibrationSampleInvalid();
        } else if (actionIs("discard")) {
            success = g_app->discardFlowCalibrationMeasurement();
        } else if (actionIs("update")) {
            uint32_t sampleNumber = 0;
            uint32_t measuredMl = 0;
            success = uintParam("sample", 1, FlowCalibrationService::kMaximumSamples,
                                sampleNumber) &&
                      uintParam("measured_ml",
                                FlowCalibrationService::kMinimumMeasuredWaterMl,
                                FlowCalibrationService::kMaximumMeasuredWaterMl,
                                measuredMl) &&
                      g_app->updateFlowCalibrationMeasurement(
                          static_cast<uint8_t>(sampleNumber - 1U), measuredMl);
        } else if (actionIs("delete")) {
            uint32_t sampleNumber = 0;
            success = uintParam("sample", 1, FlowCalibrationService::kMaximumSamples,
                                sampleNumber) &&
                      g_app->deleteFlowCalibrationSample(
                          static_cast<uint8_t>(sampleNumber - 1U));
        } else if (actionIs("apply")) {
            success = g_app->applyFlowCalibrationResult();
        } else if (actionIs("parameters")) {
            char coefficientText[20]{};
            FlowMeterConfig parameters{};
            success = getParam("coefficient", coefficientText, sizeof(coefficientText)) &&
                      IrrigationConfigRules::parsePulsesPerLiter(
                          coefficientText, parameters.pulsesPerLiterX100) &&
                      uintParam("startup_pulses", 0, 10000000,
                                parameters.calibrationStartupPulseCount) &&
                      uintParam("startup_water_ml", 0, 1000000,
                                parameters.calibrationStartupWaterMl) &&
                      g_app->saveFlowCalibrationParameters(parameters);
        } else if (actionIs("clear")) {
            g_app->resetFlowCalibration();
            success = !g_app->wateringStatus().active;
        }
        redirectResult("/irrigation/zones/flow-calibration", success);
        return;
    }
    if (!beginPage("流量计校准", "识别稳定出水阶段，用多组实测总水量计算稳态流量系数")) return;
    Esp32BaseWeb::sendChunk(
        "<style>"
        ".cal-current-toolbar{display:flex;align-items:center;justify-content:space-between;gap:12px;margin-bottom:9px}.cal-current-toolbar p{margin:0;color:var(--eb-muted);font-size:12px;line-height:1.5}.cal-current-toolbar button{flex:0 0 auto;white-space:nowrap}.cal-current{display:grid;grid-template-columns:repeat(3,minmax(0,1fr));gap:0;align-items:stretch;border:1px solid var(--eb-line-soft);border-radius:9px;background:#fff;overflow:hidden}"
        ".cal-current-fact{min-width:0;padding:10px 13px;border-right:1px solid var(--eb-line-soft)}.cal-current-fact:last-child{border-right:0}.cal-current-label{display:block;color:var(--eb-muted);font-size:11px}.cal-current-value{display:block;margin-top:3px;color:var(--eb-text);font-size:17px;font-weight:400;line-height:1.35}.cal-current-unit{font-size:12px;color:var(--eb-muted)}"
        ".cal-steps{display:grid;grid-template-columns:repeat(3,minmax(0,1fr));gap:10px;margin-bottom:14px}"
        ".cal-step{display:grid;grid-template-columns:28px minmax(0,1fr);gap:9px;align-items:start;padding:12px;border:1px solid var(--eb-line-soft);border-radius:9px;background:var(--eb-soft);font-size:13px;line-height:1.55}"
        ".cal-step-num{display:flex;align-items:center;justify-content:center;width:26px;height:26px;border-radius:50%;background:var(--eb-primary-soft);color:var(--eb-primary);font-weight:600}"
        ".cal-action{padding:13px 14px;border:1px solid var(--eb-line-soft);border-radius:10px;background:#fff}"
        ".cal-start-form{display:grid;grid-template-columns:minmax(620px,1.45fr) minmax(260px,.55fr);gap:18px;align-items:stretch}.cal-start-main{display:grid;grid-template-columns:minmax(190px,.58fr) minmax(360px,1.42fr);gap:16px;align-items:start}.cal-zone-field{margin:0}.cal-zone-field label,.cal-stop-group legend,.cal-stop-value label{font-weight:500}.cal-zone-field select{width:100%;margin-top:7px}.cal-stop-group{min-width:0;margin:0;padding:0;border:0}.cal-stop-group legend{margin:0 0 7px;padding:0}.cal-stop-options{display:grid;grid-template-columns:repeat(2,minmax(0,1fr));gap:9px}.cal-stop-option{position:relative;display:block;min-width:0;cursor:pointer}.cal-stop-option input{position:absolute;opacity:0;pointer-events:none}.cal-stop-card{display:block;height:100%;padding:11px 12px;border:1px solid var(--eb-line);border-radius:9px;background:#fff;transition:border-color .15s ease,background .15s ease,box-shadow .15s ease}.cal-stop-option input:checked+.cal-stop-card{border-color:var(--eb-primary);background:var(--eb-primary-soft);box-shadow:0 0 0 1px var(--eb-primary)}.cal-stop-option input:focus-visible+.cal-stop-card{outline:2px solid var(--eb-primary);outline-offset:2px}.cal-stop-title{display:flex;align-items:center;justify-content:space-between;gap:8px;color:var(--eb-text);font-size:14px;font-weight:500}.cal-stop-mark{display:flex;align-items:center;justify-content:center;width:18px;height:18px;border:1px solid var(--eb-line);border-radius:50%;background:#fff}.cal-stop-mark:after{content:'';width:8px;height:8px;border-radius:50%;background:transparent}.cal-stop-option input:checked+.cal-stop-card .cal-stop-mark{border-color:var(--eb-primary)}.cal-stop-option input:checked+.cal-stop-card .cal-stop-mark:after{background:var(--eb-primary)}.cal-stop-desc{display:block;margin-top:4px;color:var(--eb-muted);font-size:11px;line-height:1.4}.cal-stop-value{display:flex;align-items:flex-end;gap:10px;margin-top:10px;padding:10px 12px;border-radius:9px;background:var(--eb-soft)}.cal-stop-value[hidden]{display:none}.cal-stop-value>div{min-width:0}.cal-stop-value input{width:140px;margin-top:6px;background:#fff}.cal-stop-value small{display:block;padding-bottom:9px;color:var(--eb-muted);font-size:11px;line-height:1.4}.cal-start-picker>.actions{margin-top:12px}.cal-start-info{display:flex;flex-direction:column;justify-content:center;padding-left:18px;border-left:1px solid var(--eb-line-soft);color:var(--eb-muted);font-size:12px;line-height:1.55}.cal-start-info b{color:var(--eb-text);font-size:13px;font-weight:500}.cal-start-info span{display:block;margin-top:4px}"
        ".cal-live-head{display:flex;align-items:flex-start;justify-content:space-between;gap:12px;margin-bottom:14px}.cal-live-head h3{margin:0 0 3px;font-size:17px}.cal-live-head p{margin:0;color:var(--eb-muted);font-size:13px}"
        ".cal-live .metrics{grid-template-columns:repeat(auto-fit,minmax(140px,1fr))}.cal-live .metric b{font-weight:500}.cal-live .metric small{display:block;margin-top:4px;color:var(--eb-muted);font-size:11px;font-weight:400;line-height:1.4}.cal-live .actions{margin-top:12px}.cal-live-note{display:flex;flex-wrap:wrap;gap:8px 18px;margin-top:10px;padding:10px 12px;border-radius:8px;background:var(--eb-soft);color:var(--eb-muted);font-size:12px;line-height:1.5}.cal-live-note b{color:var(--eb-text);font-weight:400}"
        ".cal-pending{display:grid;grid-template-columns:minmax(0,1.25fr) minmax(280px,.75fr);gap:18px;align-items:start}.cal-pending-summary{padding:12px 13px;border-radius:9px;background:var(--eb-soft)}.cal-pending-summary h3{margin:0 0 3px;font-size:16px;font-weight:500}.cal-pending-route{margin:0 0 9px;color:var(--eb-muted);font-size:12px}.cal-phase-grid{display:grid;grid-template-columns:repeat(2,minmax(0,1fr));gap:8px}.cal-phase{padding:8px 9px;border:1px solid var(--eb-line-soft);border-radius:8px;background:#fff}.cal-phase-label{display:block;color:var(--eb-muted);font-size:11px}.cal-phase-value{display:block;margin-top:3px;color:var(--eb-text);font-size:13px;font-weight:400;line-height:1.4}.cal-phase-note{display:block;margin-top:2px;color:var(--eb-muted);font-size:11px;line-height:1.35}.cal-pending-total{margin:8px 0 0;color:var(--eb-muted);font-size:12px}.cal-pending-warning{color:var(--eb-danger)}.cal-pending label{font-weight:500}"
        ".cal-sample-toolbar{display:flex;align-items:center;justify-content:space-between;gap:12px;margin-bottom:10px}.cal-counts{display:flex;flex-wrap:wrap;gap:7px}.cal-count{padding:5px 9px;border-radius:999px;background:var(--eb-soft);color:var(--eb-muted);font-size:12px}.cal-count b{color:var(--eb-text);font-weight:500}.cal-count.ok{background:var(--eb-ok-soft);color:var(--eb-ok)}.cal-count.bad{background:var(--eb-danger-soft);color:var(--eb-danger)}"
        ".cal-sample-guide{margin:-2px 0 10px;color:var(--eb-muted);font-size:11px;line-height:1.5}.cal-sample-list{border:1px solid var(--eb-line-soft);border-radius:9px;overflow:hidden}.cal-sample-columns,.cal-sample{display:grid;grid-template-columns:minmax(95px,.65fr) minmax(135px,.9fr) minmax(160px,1.05fr) minmax(210px,1.35fr) minmax(200px,1.25fr) auto;gap:12px;align-items:center}.cal-sample-columns{padding:7px 11px;background:var(--eb-soft);color:var(--eb-muted);font-size:11px}.cal-sample{padding:10px 11px;background:#fff;border-top:1px solid var(--eb-line-soft)}.cal-sample:first-of-type{border-top:0}.cal-sample-cell{min-width:0}.cal-sample-main{display:block;color:var(--eb-text);font-size:13px;font-weight:400;line-height:1.4;overflow-wrap:anywhere}.cal-sample-sub{display:block;margin-top:2px;color:var(--eb-muted);font-size:11px;font-weight:400;line-height:1.4;overflow-wrap:anywhere}.cal-sample-sub.warn{color:var(--eb-danger)}.cal-sample-actions{display:flex;align-items:center;justify-content:flex-end;gap:6px;white-space:nowrap}.cal-sample-actions form{margin:0}.cal-sample-actions button,.cal-sample-actions input{min-height:30px;padding:5px 9px;font-size:12px}.cal-status{display:inline-flex;align-items:center;margin-left:5px;padding:2px 7px;border-radius:999px;font-size:11px;font-weight:400}.cal-status.ok{background:var(--eb-ok-soft);color:var(--eb-ok)}.cal-status.bad{background:var(--eb-danger-soft);color:var(--eb-danger)}"
        ".cal-empty{padding:20px;text-align:center;border:1px dashed #c9d6dc;border-radius:9px;background:var(--eb-soft)}"
        ".cal-empty-title{margin:0;color:#344054;font-size:15px;font-weight:500}"
        ".cal-empty-text{margin:5px 0 0;color:var(--eb-muted);font-size:13px}"
        ".cal-result{padding:12px 13px;border:1px solid var(--eb-line-soft);border-radius:9px;background:#fff}.cal-result-head{display:flex;align-items:center;justify-content:space-between;gap:12px;margin-bottom:10px}.cal-result-head-left{display:flex;align-items:center;gap:8px}.cal-result-head p{margin:0;color:var(--eb-muted);font-size:12px}.cal-result-head form{margin:0}.cal-result-grid{display:grid;grid-template-columns:repeat(3,minmax(0,1fr));border:1px solid var(--eb-line-soft);border-radius:8px;overflow:hidden}.cal-result-fact{min-width:0;padding:9px 10px;border-right:1px solid var(--eb-line-soft);background:var(--eb-soft)}.cal-result-fact:last-child{border-right:0}.cal-result-fact span{display:block;color:var(--eb-muted);font-size:11px}.cal-result-fact b{display:block;margin-top:3px;color:var(--eb-text);font-size:15px;font-weight:400}.cal-result-meta{display:flex;flex-wrap:wrap;gap:5px 16px;margin-top:8px;color:var(--eb-muted);font-size:11px;line-height:1.5}.cal-result-note{margin:8px 0 0;color:var(--eb-muted);font-size:11px;line-height:1.5}"
        ".cal-sample-toolbar form{margin:0}.cal-sample-toolbar input{min-height:30px;padding:5px 10px;font-size:12px}"
        ".cal-edit{width:min(460px,calc(100vw - 28px))}.cal-edit h2{margin-bottom:4px}.cal-edit>p{margin-top:0}.cal-parameters{width:min(760px,calc(100vw - 28px))}.cal-parameter-grid{display:grid;grid-template-columns:repeat(3,minmax(0,1fr));gap:14px;margin-top:16px}.cal-parameter-grid .field{min-width:0;margin:0;padding:12px;border:1px solid var(--eb-line-soft);border-radius:8px;background:var(--eb-soft)}.cal-parameter-grid label{font-weight:500}.cal-parameter-grid input{width:100%;margin:6px 0 0;background:#fff}.cal-parameter-grid small{display:block;margin-top:5px;color:var(--eb-muted);font-size:11px;line-height:1.4}.cal-parameters .actions{margin-top:18px}"
        "@media(max-width:1150px){.cal-sample-columns{display:none}.cal-sample{grid-template-columns:repeat(2,minmax(0,1fr)) auto}.cal-sample-actions{grid-column:3;grid-row:1/span 3}}"
        "@media(max-width:900px){.cal-start-form{grid-template-columns:1fr}.cal-start-info{padding:11px 0 0;border-left:0;border-top:1px solid var(--eb-line-soft)}.cal-phase-grid{grid-template-columns:1fr}.cal-result-grid{grid-template-columns:repeat(2,minmax(0,1fr))}.cal-result-fact:nth-child(2){border-right:0}.cal-result-fact:nth-child(-n+2){border-bottom:1px solid var(--eb-line-soft)}}"
        "@media(max-width:760px){"
        ".cal-steps{grid-template-columns:1fr}"
        ".cal-start-main{grid-template-columns:1fr}.cal-live .metrics{grid-template-columns:repeat(2,minmax(0,1fr))}.cal-pending{grid-template-columns:1fr}.cal-sample-toolbar{align-items:flex-start}.cal-sample{grid-template-columns:1fr auto}.cal-sample-actions{grid-column:2;grid-row:1/span 5}.cal-parameter-grid{grid-template-columns:1fr}"
        "}"
        "@media(max-width:560px){.cal-stop-options{grid-template-columns:1fr}.cal-stop-value{align-items:stretch;flex-direction:column}.cal-stop-value input{width:100%}.cal-stop-value small{padding-bottom:0}.cal-current-toolbar{align-items:stretch;flex-direction:column}.cal-current-toolbar button{width:100%}.cal-current{grid-template-columns:1fr}.cal-current-fact{border-right:0;border-bottom:1px solid var(--eb-line-soft)!important}.cal-current-fact:last-child{border-bottom:0!important}.cal-result-head{align-items:flex-start}.cal-result-grid{grid-template-columns:1fr}.cal-result-fact{border-right:0;border-bottom:1px solid var(--eb-line-soft)!important}.cal-result-fact:last-child{border-bottom:0!important}.cal-sample{grid-template-columns:1fr}.cal-sample-actions{grid-column:1;grid-row:auto;justify-content:flex-start}}"
        "</style>");
    const IrrigationConfig* config = g_app->configuration();
    if (!config) { endPage(); return; }
    const WateringStatus status = g_app->wateringStatus();
    const FlowCalibrationService& calibration = g_app->flowCalibration();
    const bool active = status.active && status.purpose == WateringPurpose::FlowCalibration;
    const bool managementLocked = status.active || calibration.hasPendingMeasurement();
    char coefficient[20]{};
    IrrigationConfigRules::formatPulsesPerLiter(
        config->flowMeter.pulsesPerLiterX100, coefficient, sizeof(coefficient));
    Esp32BaseWeb::beginPanel("设备校准参数");
    Esp32BaseWeb::sendChunk("<div class='cal-current-toolbar'><p>三项设备参数统一保存；各水路的原始脉冲基准在水路学习中独立管理。</p>");
    if (!managementLocked) Esp32BaseWeb::sendChunk("<button class='secondary' type='button' onclick=\"document.getElementById('cal-parameters').showModal()\">修改参数</button>");
    Esp32BaseWeb::sendChunk("</div><div class='cal-current'><div class='cal-current-fact'><span class='cal-current-label'>启动脉冲</span><span class='cal-current-value'>");
    sendUnsigned(config->flowMeter.calibrationStartupPulseCount); Esp32BaseWeb::sendChunk(" <span class='cal-current-unit'>个</span>");
    Esp32BaseWeb::sendChunk("</span></div><div class='cal-current-fact'><span class='cal-current-label'>估算启动水量</span><span class='cal-current-value'>");
    sendUnsigned(config->flowMeter.calibrationStartupWaterMl); Esp32BaseWeb::sendChunk(" <span class='cal-current-unit'>mL</span>");
    Esp32BaseWeb::sendChunk("</span></div><div class='cal-current-fact'><span class='cal-current-label'>稳态流量系数</span><span class='cal-current-value'>"); Esp32BaseWeb::writeHtmlEscaped(coefficient); Esp32BaseWeb::sendChunk(" <span class='cal-current-unit'>P/L</span></span></div></div>");
    Esp32BaseWeb::endPanel();
    if (!managementLocked) {
        Esp32BaseWeb::sendChunk("<dialog id='cal-parameters' class='panel eb-modal cal-edit cal-parameters' data-eb-light-dismiss='1'><h2>修改校准参数</h2><p class='muted'>三项参数统一保存并读回核对；只有稳态流量系数参与流量和水量换算。</p><form method='post' action='/irrigation/zones/flow-calibration' onsubmit='return once(this)'><input type='hidden' name='action' value='parameters'><div class='cal-parameter-grid'><p class='field'><label>启动脉冲（个）</label><input type='number' name='startup_pulses' min='0' max='10000000' step='1' required value='"); sendUnsigned(config->flowMeter.calibrationStartupPulseCount); Esp32BaseWeb::sendChunk("'><small>0 表示未设置。</small></p><p class='field'><label>估算启动水量（mL）</label><input type='number' name='startup_water_ml' min='0' max='1000000' step='1' required value='"); sendUnsigned(config->flowMeter.calibrationStartupWaterMl); Esp32BaseWeb::sendChunk("'><small>0 表示未设置。</small></p><p class='field'><label>稳态流量系数（P/L）</label><input type='number' name='coefficient' min='0.01' max='100000.00' step='0.01' required value='"); Esp32BaseWeb::writeHtmlEscaped(coefficient); Esp32BaseWeb::sendChunk("'><small>用于脉冲、流量和水量换算。</small></p></div><div class='actions'><button class='secondary' type='button' onclick='this.closest(\"dialog\").close()'>取消</button><input type='submit' value='保存参数'></div></form></dialog>");
    }
    Esp32BaseWeb::beginPanel("开始校准");
    Esp32BaseWeb::sendChunk("<div class='cal-steps'><div class='cal-step'><span class='cal-step-num'>1</span><span>从完全停止状态开始接水，系统自动识别进入稳态的时刻。</span></div><div class='cal-step'><span class='cal-step-num'>2</span><span>停止后填写实测总水量；至少两个不同水量，建议三个样本。</span></div><div class='cal-step'><span class='cal-step-num'>3</span><span>仅用稳态阶段脉冲拟合，确认使用后才写入设备参数。</span></div></div><div class='cal-action'>");
    if (status.active && !active) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_WARN, "设备正在执行其它任务", "请等待当前任务结束后再校准。");
    } else if (active) {
        const uint8_t zoneId = status.activeZoneId;
        const ZoneWateringSummary& liveZone = status.zones[status.currentStepIndex];
        const char* zoneName = zoneId >= 1 && zoneId <= config->zones.size()
                                   ? config->zones[zoneId - 1U].name.data()
                                   : "当前水路";
        char liveRate[24]{};
        formatSignedHundredths(liveZone.calibrationLatestPulseRateX100,
                               liveRate,
                               sizeof(liveRate));
        char liveSteadyRate[24]{};
        formatPulseRate(liveZone.calibrationSteadyPulses,
                        liveZone.calibrationSteadyDurationMs,
                        liveSteadyRate,
                        sizeof(liveSteadyRate));
        Esp32BaseWeb::sendChunk("<div id='cal-live' class='cal-live'><div class='cal-live-head'><div><h3>"); Esp32BaseWeb::writeHtmlEscaped(zoneName); Esp32BaseWeb::sendChunk("</h3><p id='cal-state'>"); Esp32BaseWeb::writeHtmlEscaped(wateringStateName(status.state)); Esp32BaseWeb::sendChunk("</p></div><span class='tag warn'>正在采样</span></div><div class='metrics'><div class='metric'><b id='cal-elapsed'>"); sendDuration(status.elapsedSec); Esp32BaseWeb::sendChunk("</b><span>已运行</span></div><div class='metric'><b id='cal-pulses'>"); sendUnsigned(status.pulseCount); Esp32BaseWeb::sendChunk("</b><span>完整脉冲</span></div><div class='metric'><b id='cal-water'>"); sendLiters(liveZone.estimatedWaterMl); Esp32BaseWeb::sendChunk("</b><span>估算出水量</span><small id='cal-target-note'>"); if (status.currentZoneTargetWaterMl != 0) { Esp32BaseWeb::sendChunk("目标 "); sendLiters(status.currentZoneTargetWaterMl); } else Esp32BaseWeb::sendChunk("按时间自动停止"); Esp32BaseWeb::sendChunk("</small></div><div class='metric'><b id='cal-steady-state'>");
        if (liveZone.calibrationSteadyDetected) {
            Esp32BaseWeb::sendChunk("已确认");
        } else if (!status.flowEstablished) {
            Esp32BaseWeb::sendChunk("等待水流");
        } else if (liveZone.calibrationCollectedWindows >=
                   liveZone.calibrationRequiredWindows) {
            Esp32BaseWeb::sendChunk("波动偏大");
        } else {
            Esp32BaseWeb::sendChunk("已采集 ");
            sendUnsigned(liveZone.calibrationCollectedWindows);
            Esp32BaseWeb::sendChunk(" / ");
            sendUnsigned(liveZone.calibrationRequiredWindows);
            Esp32BaseWeb::sendChunk(" 个窗口");
        }
