tangyangguang/Esp32_Irrigation/firmware/src/irrigation/IrrigationWeb.cpp
    Esp32BaseWeb::beginPanel("计算结果");
    if (!calibration.resultReady()) {
        if (calibration.validSampleCount() < 2) {
            Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_INFO, "还不能计算结果", "至少需要两个不同水量的有效样本；无效样本不会参与计算。");
        } else {
            Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_WARN, "当前样本无法形成有效结果", "请检查水量是否存在差异、脉冲是否随水量增加，或删除有问题的样本后重试。");
        }
    } else {
        char result[20]{};
        IrrigationConfigRules::formatPulsesPerLiter(
            calibration.combinedPulsesPerLiterX100(), result, sizeof(result));
        const bool canApply = calibration.combinedStartupPulseCount() <= 10000000U &&
                              calibration.combinedStartupWaterMl() <= 1000000U;
        const bool matchesCurrent =
            config->flowMeter.pulsesPerLiterX100 ==
                calibration.combinedPulsesPerLiterX100() &&
            config->flowMeter.calibrationStartupPulseCount ==
                calibration.combinedStartupPulseCount() &&
            config->flowMeter.calibrationStartupWaterMl ==
                calibration.combinedStartupWaterMl();
        const bool appliedInSession = calibration.appliedCoefficientX100() ==
                                      calibration.combinedPulsesPerLiterX100() &&
                                      calibration.appliedEpoch() != 0;
        char maximumResidual[32]{};
        formatSignedHundredths(calibration.maximumResidualPercentX100(),
                               maximumResidual,
                               sizeof(maximumResidual));
        Esp32BaseWeb::sendChunk("<div class='cal-result'><div class='cal-result-head'><div class='cal-result-head-left'><p>当前样本计算结果</p><span class='tag "); Esp32BaseWeb::sendChunk(matchesCurrent ? "ok'>设备正在使用" : "warn'>尚未应用"); Esp32BaseWeb::sendChunk("</span></div>");
        if (!matchesCurrent && canApply && !managementLocked) Esp32BaseWeb::sendChunk("<form method='post' action='/irrigation/zones/flow-calibration' onsubmit=\"return confirm('确认保存并使用当前样本生成的三项校准参数？')&&once(this)\"><input type='hidden' name='action' value='apply'><input type='submit' value='使用此结果'></form>");
        Esp32BaseWeb::sendChunk("</div><div class='cal-result-grid'><div class='cal-result-fact'><span>启动脉冲</span><b>"); sendUnsigned(calibration.combinedStartupPulseCount()); Esp32BaseWeb::sendChunk(" 个</b></div><div class='cal-result-fact'><span>估算启动水量</span><b>"); sendUnsigned(calibration.combinedStartupWaterMl()); Esp32BaseWeb::sendChunk(" mL</b></div><div class='cal-result-fact'><span>稳态流量系数</span><b>"); Esp32BaseWeb::writeHtmlEscaped(result); Esp32BaseWeb::sendChunk(" P/L</b></div></div><div class='cal-result-meta'><span>有效样本："); sendUnsigned(calibration.validSampleCount()); Esp32BaseWeb::sendChunk(" 个</span><span>涉及水路："); sendUnsigned(calibration.validZoneCount()); Esp32BaseWeb::sendChunk(" 条</span><span>水量跨度："); sendUnsigned(calibration.volumeSpanMl()); Esp32BaseWeb::sendChunk(" mL</span><span>最大拟合残差："); if (calibration.validSampleCount() == 2) Esp32BaseWeb::sendChunk("暂无法检验"); else { Esp32BaseWeb::writeHtmlEscaped(maximumResidual); Esp32BaseWeb::sendChunk("%"); } Esp32BaseWeb::sendChunk("</span><span>结果更新：");
        char timeText[32]{};
        if (calibration.resultUpdatedEpoch() != 0 && Esp32BaseTime::formatEpoch(calibration.resultUpdatedEpoch(), timeText, sizeof(timeText), "%Y-%m-%d %H:%M:%S")) Esp32BaseWeb::writeHtmlEscaped(timeText); else Esp32BaseWeb::sendChunk("设备时间不可用");
        Esp32BaseWeb::sendChunk("</span>");
        if (calibration.appliedEpoch() != 0) { Esp32BaseWeb::sendChunk(appliedInSession ? "<span>应用时间：" : "<span>上次应用："); if (Esp32BaseTime::formatEpoch(calibration.appliedEpoch(), timeText, sizeof(timeText), "%Y-%m-%d %H:%M:%S")) Esp32BaseWeb::writeHtmlEscaped(timeText); else Esp32BaseWeb::sendChunk("设备时间不可用"); Esp32BaseWeb::sendChunk("</span>"); }
        Esp32BaseWeb::sendChunk("</div><p class='cal-result-note'>计算关系：实测总水量 = 估算启动水量 + 稳态脉冲 ÷ 稳态流量系数。启动脉冲只记录进入稳态前的实际脉冲；若停止后仍有脉冲，样本会单独提示关闭尾水。</p></div>");
        if (!canApply) Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_WARN, "部分结果超出可保存范围", "请检查样本，或使用上方“修改参数”手工设置合理数值。");
        const uint8_t flags = calibration.qualityFlags();
        if (calibration.volumeSpanMl() >= 1000U) Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_OK, "水量跨度达到 1 L", "这组样本对量杯读数误差更不敏感。");
        if (flags & FlowCalibrationService::kQualityOnlyTwoSamples) Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_INFO, "当前只有两个有效样本", "两点必然完全落在拟合直线上，暂时无法检验一致性；结果可以使用，建议增加第三个样本。");
        if (flags & FlowCalibrationService::kQualitySmallVolumeSpan) Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_WARN, "水量差小于 500 mL", "量杯误差容易被放大，建议增加差距更大的样本。");
        if (flags & FlowCalibrationService::kQualityNonMonotonic) Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_WARN, "样本趋势不完全一致", "建议检查接水读数，或删除有问题的样本。");
        if (flags & FlowCalibrationService::kQualityResidualHigh) Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_WARN, "拟合残差较大", "建议检查或补充样本后再应用。");
        if (flags & FlowCalibrationService::kQualityPostSteadyUnstable) Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_WARN, "部分样本进入稳态后仍有波动", "结果仍可使用，请结合样本中的稳态速率和拟合偏差判断。");
        if (flags & FlowCalibrationService::kQualityNegativeStartupWater) Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_WARN, "无法得到正的启动水量", "当前样本与阶段模型不完全一致，建议启动水量已按 0 mL 生成；可以检查样本或手工修改参数。");
        if (calibration.validZoneCount() > 1) Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_INFO, "样本来自不同水路", "不同水路的启动特性可能不同，请结合每条样本的拟合偏差判断；系统不会限制应用。");
    }
    Esp32BaseWeb::endPanel();

    for (uint8_t index = 0; index < calibration.sampleCount(); ++index) {
        const FlowCalibrationService::Sample* sample = calibration.sample(index);
        if (!sample || !sample->valid || managementLocked) continue;
        Esp32BaseWeb::sendChunk("<dialog id='cal-edit-"); sendUnsigned(index + 1U); Esp32BaseWeb::sendChunk("' class='panel eb-modal cal-edit' data-eb-light-dismiss='1'><h2>修改样本 "); sendUnsigned(index + 1U); Esp32BaseWeb::sendChunk("</h2><p class='muted'>只能修正实测总水量；设备记录的脉冲、时间和停止原因不会改变。</p><form method='post' action='/irrigation/zones/flow-calibration' onsubmit='return once(this)'><input type='hidden' name='action' value='update'><input type='hidden' name='sample' value='"); sendUnsigned(index + 1U); Esp32BaseWeb::sendChunk("'><div class='fieldgrid'><p class='field full'><label>实测总水量</label><input type='number' name='measured_ml' min='1000' max='1000000' step='1' inputmode='numeric' required value='"); sendUnsigned(sample->measuredWaterMl); Esp32BaseWeb::sendChunk("'><small>单位 mL，保存后结果会自动重新计算。</small></p></div><div class='actions'><button class='secondary' type='button' onclick='this.closest(\"dialog\").close()'>取消</button><input type='submit' value='保存修改'></div></form></dialog>");
    }
    if (active) Esp32BaseWeb::sendChunk("<script>(function(){function set(id,v){var e=document.getElementById(id);if(e)e.textContent=v}function duration(v){v=Math.max(0,Number(v)||0);if(v<60)return v+' 秒';return Math.floor(v/60)+' 分 '+(v%60)+' 秒'}function liters(v){return (Math.max(0,Number(v)||0)/1000).toFixed(3)+' L'}function millis(v){v=Math.max(0,Number(v)||0);return (v/1000).toFixed(1)+' 秒'}function rate(p,m){m=Number(m)||0;return m>0?(Number(p||0)*1000/m).toFixed(2):'—'}function poll(){fetch('/irrigation/api/status',{cache:'no-store',credentials:'same-origin'}).then(function(r){return r.json()}).then(function(s){if(!s.active||s.purpose!==1){location.reload();return}var states=['空闲','区域启动中','等待水流','正在采样','正在停止'];set('cal-state',states[s.state]||'状态未知');set('cal-elapsed',duration(s.elapsedSec));set('cal-remaining',duration(s.currentZoneRemainingSec));set('cal-pulses',s.pulseCount);set('cal-target-note',Number(s.currentZoneTargetWaterMl||0)?'目标 '+liters(s.currentZoneTargetWaterMl):'按时间自动停止');var z=s.zones&&s.zones[s.currentStepIndex];if(z){set('cal-water',liters(z.estimatedWaterMl));var detected=!!z.calibrationSteadyDetected,flow=!!s.flowEstablished,full=Number(z.calibrationCollectedWindows||0)>=Number(z.calibrationRequiredWindows||0);set('cal-steady-state',detected?'已确认':(!flow?'等待水流':(full?'波动偏大':'已采集 '+z.calibrationCollectedWindows+' / '+z.calibrationRequiredWindows+' 个窗口')));set('cal-steady-help',detected?'后续波动仍会继续监测':(!flow?'检测到脉冲后开始统计':(full?'最近 '+z.calibrationRequiredWindows+' 个窗口尚未满足波动要求，继续识别':'收满 '+z.calibrationRequiredWindows+' 个窗口后比较速率波动')));set('cal-startup-phase',detected?millis(z.calibrationSteadyStartedMs)+' · '+z.calibrationStartupPulses+' 脉冲':'等待稳态确认');set('cal-steady-phase',detected?millis(z.calibrationSteadyDurationMs)+' · '+z.calibrationSteadyPulses+' 脉冲 · '+rate(z.calibrationSteadyPulses,z.calibrationSteadyDurationMs)+' P/s':'尚未开始');set('cal-rate',(Number(z.calibrationLatestPulseRateX100||0)/100).toFixed(2)+' P/s')}setTimeout(poll,1000)}).catch(function(){setTimeout(poll,2000)})}setTimeout(poll,1000)})();</script>");
    endPage();
}

